# 班级的学生数据，学生ID和学生姓名的映射关系
student_name_mapping = {
    "1": "张三",
    "2": "李四",
    "3": "王五"
}

# 班级的课程数据，班级下课程ID和课程名称的映射关系
class_course_mapping = {
    "201": "语文",
    "202": "数学",
    "203": "英语"
}

# 课程下的单元数据，课程下单元ID和单元名称的映射关系
course_unit_mapping = {
    "201": {
        "30001": "现代散文",
        "30002": "诗词赏析"
    },
    "202": {
        "30003": "数学运算",
        "30004": "几何图形"
    },
    "203": {
        "30005": "英语听力",
        "30006": "英语阅读"
    }
}

# 单元下的活动数据，单元ID和单元下活动ID、活动名称、活动发布时间的映射关系
unit_activity_mapping = {
    "30001": {  # 现代散文单元
        "1001": {"name": "朱自清散文朗读", "time": "2024-04-01 08:00:00"},    # 课文朗读活动
        "1002": {"name": "朱自清课文默写", "time": "2024-04-02 08:00:00"}     # 课文默写活动          
    },
    "30002": {  # 诗词赏析单元
        "1003": {"name": "李白诗词赏析", "time": "2024-04-03 08:00:00"},    # 诗词赏析活动
        "1004": {"name": "杜甫诗词赏析", "time": "2024-04-04 08:00:00"}      # 诗词赏析活动
    },
    "30003": {  # 数学运算单元
        "1005": {"name": "实数运算", "time": "2024-04-05 08:00:00"},      # 实数运算活动
        "1006": {"name": "虚数运算", "time": "2024-04-06 08:00:00"}      # 虚数运算活动
    },
    "30004": {  # 几何图形单元
        "1007": {"name": "平面几何", "time": "2024-04-07 08:00:00"},      # 平面几何活动
        "1008": {"name": "立体几何", "time": "2024-04-08 08:00:00"}      # 立体几何活动
    },
    "30005": {  # 英语听力单元
        "1009": {"name": "日常对话听力", "time": "2024-04-09 08:00:00"},    # 日常对话听力活动
        "1010": {"name": "新闻听力", "time": "2024-04-10 08:00:00"}      # 新闻听力活动
    },
    "30006": {  # 英语阅读单元
        "1011": {"name": "短文阅读", "time": "2024-04-11 08:00:00"},    # 短文阅读活动
        "1012": {"name": "长文阅读", "time": "2024-04-12 08:00:00"}      # 长文阅读活动
    }
}

# 参与活动的各学生的成绩：活动ID和学生ID，学生活动成绩的映射关系
activity_student_score_mapping = {
    "1001": {
        "1": 90,
        "2": 85,
        "3": 88
    },
    "1002": {
        "1": 92,
        "2": 87,
        "3": 90
    },
    "1003": {
        "1": 85,
        "3": 91
    },
    "1004": {
        "1": 78,
        "2": 82,
        "3": 80
    },
    "1005": {
        "2": 75,
        "3": 79
    },
    "1006": {
        "3": 88
    },
    "1007": {
        "1": 84,
        "2": 81
    },
    "1008": {
        "1": 90,
        "2": 85,
        "3": 87
    },
    "1009": {
        "1": 92,
        "2": 89,
        "3": 91
    },
    "1010": {
        "1": 88,
        "2": 84,
        "3": 86
    },
    "1011": {
        "1": 85,
        "3": 90
    },
    "1012": {
        "1": 87,
        "2": 83,
        "3": 89
    }
}